----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [-1, 512, 28, 28]           1,024
            Conv2d-2          [-1, 256, 28, 28]         131,072
       BatchNorm2d-3          [-1, 256, 28, 28]             512
              ReLU-4          [-1, 256, 28, 28]               0
            Conv2d-5          [-1, 256, 14, 14]         589,824
       BatchNorm2d-6          [-1, 256, 14, 14]             512
              ReLU-7          [-1, 256, 14, 14]               0
            Conv2d-8         [-1, 1024, 14, 14]         262,144
       BatchNorm2d-9         [-1, 1024, 14, 14]           2,048
           Conv2d-10         [-1, 1024, 14, 14]         524,288
      BatchNorm2d-11         [-1, 1024, 14, 14]           2,048
             ReLU-12         [-1, 1024, 14, 14]               0
       Bottleneck-13         [-1, 1024, 14, 14]               0
           Conv2d-14          [-1, 256, 14, 14]         262,144
      BatchNorm2d-15          [-1, 256, 14, 14]             512
             ReLU-16          [-1, 256, 14, 14]               0
           Conv2d-17          [-1, 256, 14, 14]         589,824
      BatchNorm2d-18          [-1, 256, 14, 14]             512
             ReLU-19          [-1, 256, 14, 14]               0
           Conv2d-20         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-21         [-1, 1024, 14, 14]           2,048
             ReLU-22         [-1, 1024, 14, 14]               0
       Bottleneck-23         [-1, 1024, 14, 14]               0
           Conv2d-24          [-1, 256, 14, 14]         262,144
      BatchNorm2d-25          [-1, 256, 14, 14]             512
             ReLU-26          [-1, 256, 14, 14]               0
           Conv2d-27          [-1, 256, 14, 14]         589,824
      BatchNorm2d-28          [-1, 256, 14, 14]             512
             ReLU-29          [-1, 256, 14, 14]               0
           Conv2d-30         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-31         [-1, 1024, 14, 14]           2,048
             ReLU-32         [-1, 1024, 14, 14]               0
       Bottleneck-33         [-1, 1024, 14, 14]               0
           Conv2d-34          [-1, 256, 14, 14]         262,144
      BatchNorm2d-35          [-1, 256, 14, 14]             512
             ReLU-36          [-1, 256, 14, 14]               0
           Conv2d-37          [-1, 256, 14, 14]         589,824
      BatchNorm2d-38          [-1, 256, 14, 14]             512
             ReLU-39          [-1, 256, 14, 14]               0
           Conv2d-40         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-41         [-1, 1024, 14, 14]           2,048
             ReLU-42         [-1, 1024, 14, 14]               0
       Bottleneck-43         [-1, 1024, 14, 14]               0
           Conv2d-44          [-1, 256, 14, 14]         262,144
      BatchNorm2d-45          [-1, 256, 14, 14]             512
             ReLU-46          [-1, 256, 14, 14]               0
           Conv2d-47          [-1, 256, 14, 14]         589,824
      BatchNorm2d-48          [-1, 256, 14, 14]             512
             ReLU-49          [-1, 256, 14, 14]               0
           Conv2d-50         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-51         [-1, 1024, 14, 14]           2,048
             ReLU-52         [-1, 1024, 14, 14]               0
       Bottleneck-53         [-1, 1024, 14, 14]               0
           Conv2d-54          [-1, 256, 14, 14]         262,144
      BatchNorm2d-55          [-1, 256, 14, 14]             512
             ReLU-56          [-1, 256, 14, 14]               0
           Conv2d-57          [-1, 256, 14, 14]         589,824
      BatchNorm2d-58          [-1, 256, 14, 14]             512
             ReLU-59          [-1, 256, 14, 14]               0
           Conv2d-60         [-1, 1024, 14, 14]         262,144
      BatchNorm2d-61         [-1, 1024, 14, 14]           2,048
             ReLU-62         [-1, 1024, 14, 14]               0
       Bottleneck-63         [-1, 1024, 14, 14]               0
           Conv2d-64          [-1, 512, 14, 14]         524,288
      BatchNorm2d-65          [-1, 512, 14, 14]           1,024
             ReLU-66          [-1, 512, 14, 14]               0
           Conv2d-67            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-68            [-1, 512, 7, 7]           1,024
             ReLU-69            [-1, 512, 7, 7]               0
           Conv2d-70           [-1, 2048, 7, 7]       1,048,576
      BatchNorm2d-71           [-1, 2048, 7, 7]           4,096
           Conv2d-72           [-1, 2048, 7, 7]       2,097,152
      BatchNorm2d-73           [-1, 2048, 7, 7]           4,096
             ReLU-74           [-1, 2048, 7, 7]               0
       Bottleneck-75           [-1, 2048, 7, 7]               0
           Conv2d-76            [-1, 512, 7, 7]       1,048,576
      BatchNorm2d-77            [-1, 512, 7, 7]           1,024
             ReLU-78            [-1, 512, 7, 7]               0
           Conv2d-79            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-80            [-1, 512, 7, 7]           1,024
             ReLU-81            [-1, 512, 7, 7]               0
           Conv2d-82           [-1, 2048, 7, 7]       1,048,576
      BatchNorm2d-83           [-1, 2048, 7, 7]           4,096
             ReLU-84           [-1, 2048, 7, 7]               0
       Bottleneck-85           [-1, 2048, 7, 7]               0
           Conv2d-86            [-1, 512, 7, 7]       1,048,576
      BatchNorm2d-87            [-1, 512, 7, 7]           1,024
             ReLU-88            [-1, 512, 7, 7]               0
           Conv2d-89            [-1, 512, 7, 7]       2,359,296
      BatchNorm2d-90            [-1, 512, 7, 7]           1,024
             ReLU-91            [-1, 512, 7, 7]               0
           Conv2d-92           [-1, 2048, 7, 7]       1,048,576
      BatchNorm2d-93           [-1, 2048, 7, 7]           4,096
             ReLU-94           [-1, 2048, 7, 7]               0
       Bottleneck-95           [-1, 2048, 7, 7]               0
AdaptiveAvgPool2d-96           [-1, 2048, 1, 1]               0
           Linear-97                   [-1, 10]          20,490
================================================================
Total params: 22,084,618
Trainable params: 22,084,618
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 76.00
Params size (MB): 84.25
Estimated Total Size (MB): 160.25
----------------------------------------------------------------
